# 1. pandas를 import한다.
> import pandas as pd

In [2]:
import pandas as pd

#  2. DataFrames을 만든다

In [35]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

# 3. 비교/논리연산자
> < 작다  
> \> 크다  
> == 같다  != 같지않다  
> <= 작거나 같다  
> \>= 크거나 같다  
> isin(), isnull(), notnull()  
> &, |, ~, ^, df.any(), df.all()

In [36]:
df[df.a > 5]

     a  b   c
n v
e 2  6  9  12

In [37]:
df.a > 5

n  v
d  1    False
   2    False
e  2     True
Name: a, dtype: bool

In [38]:
df[df['a'] > 5]

     a  b   c
n v
e 2  6  9  12

In [19]:
df[df.b != 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12
  3  6  9  12

* 특정값이 있는지 확인
> isin([리스트])

In [20]:
df.a.isin(5)

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

In [21]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
Name: a, dtype: bool

* df['a'].isin([5]) 컬럼이름에 특수문자등이 있을 경우에 
***

In [22]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  2    False
   3    False
Name: a, dtype: bool

In [40]:
df[df['a'].isin([5])]

     a  b   c
n v
d 2  5  8  11

In [23]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False  False  False
  3  False  False  False

In [41]:
import numpy as np

df = pd.DataFrame(
    {"a" : [4 ,5, 6,6,np.nan],
    "b" : [7, 8,np.nan, 9,9],
    "c" : [10, 11, 12,np.nan,12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',1),('e',2),('e',3)],
    names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [42]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 1  False   True  False
  2  False  False   True
  3   True  False  False

In [43]:
df['a'].isnull().sum()

1

In [27]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 1   True  False   True
  2   True   True  False
  3  False   True   True

In [28]:
df.notnull()

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 1   True  False   True
  2   True   True  False
  3  False   True   True

In [53]:
df.a.notnull()

n  v
d  1     True
   2     True
e  1     True
   2     True
   3    False
Name: a, dtype: bool

*  &, |, ~, ^, df.any(), df.all()

In [59]:
~df.a.notnull()

n  v
d  1    False
   2    False
e  1    False
   2    False
   3     True
Name: a, dtype: bool

In [56]:
df[df.b==7] | df[df.a==5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

# 4. drop_duplicates()
* 중복된 row 제거
* 해당명령어에 ?를 붙여서 실행시 관련 설명을 볼 수 있다.
> keep='first', inplace=False

In [39]:
df.drop_duplicates?

In [34]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6,6],
    "b" : [7, 8, 9,9],
    "c" : [10, 11, 12,12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2),('e',3)],
    names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [16]:
df.drop_duplicates()

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [17]:
df.drop_duplicates(keep='last')

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [18]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

# 5. head(n)
* 위에서 n개 만큼만 보여준다. 기본값은 5

In [46]:
df.head()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [48]:
df.head(3)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0

# 6. tail(n)
* 끝에서 n개 만큼 보여준다. 기본값은 5

In [50]:
df.tail()

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 1  6.0  NaN  12.0
  2  6.0  9.0   NaN
  3  NaN  9.0  12.0

In [52]:
df.tail(2)

       a    b     c
n v
e 2  6.0  9.0   NaN
  3  NaN  9.0  12.0